<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Carbon\Carbon;
use DateTime;

class Normal_eventSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run() :void
    {
        //年を取得する
        $now = Carbon::now();
        $now_year = now()->year;
        $color = '#ff0000';
        /**
        * 日付を取得する関数
        * 
        * @param int $year 西暦
        * @param int $month 月
        * @param String $dayOfWeek 曜日('Sun','Mon','Tue','Wed','Thu','Fri','Sat')
        * @param int $week 週番号
        * 
        * @return int 日にち
        */
        function getDay($year,$month,$dayOfWeek,$week)
        {
            //月初めの日付を取得
            $date = new DateTime("{$year}-{$month}-01");
         
            //月の初めが指定した曜日になるまで進める
            while($date->format('D')!==$dayOfWeek){
                $date->modify('+1 day');
            }
            
            //指定した週番号になるまで進める
            for($i=1; $i<$week; $i++){
                $date->modify('+7 days');
            }
            
            //指定した月を超えた場合はエラー
            if((int)$date->format('m')!==$month){
                //その月に存在しない日付を指定した時
                return -1; 
            }
            
            return $date->format('m-d');
        }
        
        $params = 
        [
            [
                'id' => 1,
                'title' => '元旦',
                'start' => '01-01',
                'f_end' => '01-01',
                'color' => $color,
                'url' =>'/normalevent/show/1',
                
                'explanation' =>
                '元旦は年の最初の日「元日（1月1日）の朝」のことを言いますが、
                現在では元日そのものを表わす言葉として元旦が一般的に用いられてます。
                正月の最初の日(第１日目)のことを言いますが、正月３日間のことを
                「元三日（がんさんにち＝または、げんさんにち）＝年の初めの３日間との意」といい、
                「旦」とは朝や明け方という意味で、「年が明けた３ヵ日の最初の日」ということを表しています。
                年の初め・月の初め・日の初めであることから「三始(さんし)」とも言われます。',
                              
                'todo' => 
                '元日には初詣に出かけ、おせち料理を食べる習慣があります。
                玄関には門松を、リビングには鏡餅を飾ります。'
            ],
            [
                'id' => 2,
                'title' => '寒中見舞い',
                'start' => '01-07',
                'f_end' => '01-07',
                'color' => $color,
                'url' =>'/normalevent/show/2',
                
                'explanation' =>
                'お互いの近況を報告し合う季節の挨拶状としての意味だけではありません
                相手や自分が喪中の場合や、年賀状を送りそびれてしまった場合に出されることも多くなっています。
                また、お歳暮やお年賀を渡せなかった相手に対して、品物と挨拶状を一緒に贈ることもあります。',
                              
                'todo' => 
                '寒中見舞いのはがきは、関東であれば1月8日、関西やその他の地域では16日以降に相手に届けばいいとされています。
                そのため、松の内が明ける日である1月7日および15日に投函すれば問題はありません。'
            ],
            [
                'id' => 3,
                'title' => '松の内',
                'start' => '01-1',
                'f_end' => '01-7',
                'color' => $color,
                'url' =>'/normalevent/show/3',
                
                'explanation' =>
                '正月に飾る松飾り(門松)を立てておく期間のことを松の内といいます。
                年の暮れに松飾り(門松)を立ててお迎えした年神様に滞在していただく期間で、
                松を取り付けている間とか、神様に待っていただく間などという意味といわれています。',
                              
                'todo' => 
                '一般的には１月６日までとし、松飾り(門松)を６日の深夜または７日の早朝に取り除くの
                風習になっていますが、一部の地区では１４日の深夜または１５日の早朝に取り除くなど、
                地方によって異なります。※新年に入って初めて出合った人に、新年の挨拶を交わすのも松の内までです。'
            ],
            [
                'id' => 4,
                'title' => '七草',
                'start' => '01-07',
                'f_end' => '01-07',
                'color' => $color,
                'url' =>'/normalevent/show/4',
                
                 'explanation' =>
                '1月7日を過去1年の厄払いとこれからの1年の無病息災と招福を祈願する「人日の日」とされています。
                この日には、万病除けと邪気払いに良いとされる七種の野菜や雑草を入れた粥に餅を入れた七草粥を食べる習慣があります。
                胃腸の調整を計る薬草代りとも言われることから、正月のご馳走を食べた後の「箸休め」ともなるそうです。
                中国からこの日に七種類の野菜の吸い物を食べる、この風評が平安時代の日本に伝わり、
                江戸時代には今のように春の七草を食べる習慣が広まったとされているそうです。',
                              
                'todo' => 
                '春の七草：芹（せり）、薺（なずな）、母子草（ははこぐさ）、繁縷 （はこべ・はこべら）、田平子（たびらこ）、
                蕪（かぶ）、大根（だいこん）を入れた七草がゆを食べます。'
            ],
            [
                'id' => 5,
                'title' => '鏡開き',
                'start' => '01-11',
                'f_end' => '01-11',
                'color' => $color,
                'url' =>'/normalevent/show/5',
                
                 'explanation' =>
                '1月11日に正月の間に供えていた鏡餅を下げて、割り砕いて無病息災と延命を祈願して食べる習慣を「鏡開き」といいます。
                 鏡餅をこま切れにする場合は「お供え物に刃を掛けてはならない」という習わしがあることから、 
                 包丁などで切らず手で割ったり木槌などで割る習慣がありますが、その起源は鏡開きの風習の発祥である武家社会において、
                 「餅を刃物で切るのは切腹を連想させる」ということから手で割ったり木槌で砕いたりする(鏡餅を開き割る)ことにより、
                 「鏡開き」という言葉に代えて使ったことからきているそうです。
                 一般的には1月11日に行われますが、 京都など関西地方の一部や社寺では1月4日に行うところがあります。',
                              
                'todo' => 
                '1月11日に正月の間に供えていた鏡餅を下げて、割り砕いて無病息災と延命を祈願して食べます。'
            ],
            [
                'id' => 6,
                'title' => '成人式',
                'start' => getDay($now_year,1,'Mon',2),
                'f_end' => getDay($now_year,1,'Mon',2),
                'color' => $color,
                'url' =>'/normalevent/show/6',
                
                 'explanation' =>
                '成人の日には、日本各地で年度内に成人する人を祝う成人式が行われます。
                そのあとは、各学校で同窓会が開かれたり家でパーティーをしたりして盛り上がります。',
                              
                'todo' => 
                '講演会を開いたり、記念品を贈ったりします。'
            ],
            [
                'id' => 7,
                'title' => '小正月・どんど焼き',
                'start' => '01-15',
                'f_end' => '01-15',
                'color' => $color,
                'url' =>'/normalevent/show/7',
                
                 'explanation' =>
                'どんど焼きとは、小正月と呼ばれる1月15日前後に行われる行事です。
                お正月にお迎えした歳神様が煙に乗って天に帰るのをお見送りするという意味があるそうです。
                また、この炎で焼いた餅や団子を食べると1年を健康で過ごせるといわれています。',
                              
                'todo' => 
                'お正月の門松や注連縄などを持ち寄って燃やします。'
            ],
            [
                'id' => 8,
                'title' => '節分',
                'start' => '02-03',
                'f_end' => '02-03',
                'color' => $color,
                'url' =>'/normalevent/show/8',
                
                 'explanation' =>
                '立春、立夏、立秋、立冬の前日を節分といい、四季の分かれ目に行われていた四回の節分の内、
                立春前日の節分のみが現在も年中行事の一つとして残っています。
                古くは立春が正月であったことで年の変わり目に当たっていたこと、
                「鬼やらい」など他の節分にはない行事があったことが考えられます。',
                              
                'todo' => 
                '「鬼やらい」とは、いわゆる炒った豆(大豆)で厄払いする現在の節分の行事をいい、
                元々は宮中における行事の「追儺の儀式」が一般庶民に広まったもので、
                「鬼は外、福は内」と言いながら豆を撒き、季節の変わり目に多い病気や天災などの厄を
                鬼に見立てて追い出し、戸口に鰯の頭を刺した柊を取り付けて生臭さを嫌う鬼(厄)を
                近づけないようにする風習があります。'
            ],
            [
                'id' => 9,
                'title' => '立春',
                'start' => '02-04',
                'f_end' => '02-04',
                'color' => $color,
                'url' =>'/normalevent/show/9',
                
                 'explanation' =>
                '立春とは、二十四節気と呼ばれるもののひとつで、
                これを迎えることによって太陰太陽暦の新年が明けて春が来るとされていました。',
                              
                'todo' => 
                '日本人は、特にやったほうが良いとされていることはありませんが、
                お酒を飲むなどして新年を祝うこともあります。'
            ],
            [
                'id' => 10,
                'title' => 'バレンタインデー',
                'start' => '02-14',
                'f_end' => '02-14',
                'color' => $color,
                'url' =>'/normalevent/show/10',
                
                 'explanation' =>
                '日本では女性から男性にチョコレートを贈る行事として1970年代頃から一般に定着しました。',
                              
                'todo' => 
                '近年では、愛の告白としてチョコレートを贈るという行為だけでなく、
                友人や仲間などへお付き合いで贈る義理チョコや、高級チョコレートを自分へのご褒美として
                買う自分チョコなど、バレンタインデーにチョコレートを贈る習慣は多様化しています。'
            ],
            [
                'id' => 11,
                'title' => '針供養',
                'start' => '02-08',
                'f_end' => '02-08',
                'color' => $color,
                'url' =>'/normalevent/show/11',
                
                 'explanation' =>
                '2月8日を事始め、12月8日を事納めといって、この日は針仕事を休み折れたり曲がったりして
                使えなくなった針を豆腐やコンニャクに刺して、近くの寺社に持参し裁縫の上達を願って供養してもらいます。
                両日とも行なうところも残っていますが、現在では東日本地区では2月8日に、 西日本地区では12月8日に
                行われるのが一般的だそうです。
                農家では事始めに農作業を開始して、事納めには農作業を終えます。
                もともとは、婦人病治癒を始めとして安産・子授け、裁縫の上達、人形供養など、
                女性に関するあらゆることに霊験のある神とされる、和歌山の淡島神社から広まり
                全国の淡島神社の年中行事となりました。',
                              
                'todo' => 
                '針仕事を休み折れたり曲がったりして使えなくなった針を豆腐やコンニャクに刺して、
                近くの寺社に持参し裁縫の上達を願って供養してもらいます。'
            ],
            [
                'id' => 12,
                'title' => 'ひな祭り（上巳の節句）',
                'start' => '03-03',
                'f_end' => '03-03',
                'color' => $color,
                'url' =>'/normalevent/show/12',
                
                 'explanation' =>
                '中国が起源で中国では川で身を清めて不浄払いをする風習であったものが、
                日本では紙製の人形（ひとがた）を作って川に流して不浄払いをした風習と化したものが、
                後に雛人形を飾る女児の節句である雛祭りに変化したそうです。
                ひな祭りは女の子の無事と健やかな成長を願う年中行事です。',
                              
                'todo' => 
                '伝統的な装束を身にまとったひな人形を飾ったり、ひなあられと呼ばれるお菓子を
                食べたりして各家庭において祝い事をします。'
            ],
            [
                'id' => 13,
                'title' => 'ホワイトデー',
                'start' => '03-14',
                'f_end' => '03-14',
                'color' => $color,
                'url' =>'/normalevent/show/13',
                
                 'explanation' =>
                'ホワイトデーでは、バレンタインデーにプレゼントを受け取った人がお返しをする日です。
                実はあまり知られていませんが、お返しする物にも意味があるので、お返しを選ぶ際には
                気をつけましょう。
                ちなみに、キャンディは「好き」、クッキーは「あなたは友達です」、マシュマロやグミは
                「嫌い」を表すそうです。',
                              
                'todo' => 
                'バレンタインデーにプレゼントを受け取った人がお返しをします。'
            ],
            [
                'id' => 14,
                'title' => 'イースター',
                'start' => '03-31',
                'f_end' => '03-31',
                'color' => $color,
                'url' =>'/normalevent/show/14',
                
                 'explanation' =>
                '十字架にかけられて亡くなったキリストが、その3日目に復活したことを祝う「復活祭」のことです。',
                              
                'todo' => 
                '教会でキリストの復活を祝ったり、家族や仲間と食事を楽しんだりするのが定番の過ごし方です。 
                また、カラフルに装飾された卵“Easter egg”（イースター・エッグ）を自宅の庭に隠し、
                子どもたちがそれを探す“Easter egg hunt”（イースター・エッグハント）というゲームも行われます。'
            ],
            [
                'id' => 15,
                'title' => 'エイプリルフール',
                'start' => '04-01',
                'f_end' => '04-01',
                'color' => $color,
                'url' =>'/normalevent/show/15',
                
                 'explanation' =>
                'エイプリルフールは、嘘をついてもいいとされている日なので日本人は友人同士で様々な嘘や冗談を言い合います。
                 近年では企業がSNS等を通じて嘘を使ったプロモーションをする光景も多く見られるようになりました。',
                              
                'todo' => 
                '嘘をついてもいいとされている日なので日本人は友人同士で様々な嘘や冗談を言い合います。'
            ],
            [
                'id' => 16,
                'title' => '花まつり',
                'start' => '04-08',
                'f_end' => '04-08',
                'color' => $color,
                'url' =>'/normalevent/show/16',
                
                 'explanation' =>
                'お釈迦様の誕生を祝うと同時に、子どもたちの健康を祈る行事です。',
                              
                'todo' => 
                '寺院のほか、仏教系の保育園や幼稚園でも稚児行列が行われることがあります。 
                また寺院によっては、仏様へ仕える子として子どもたちに化粧を施し、
                平安装束を模した衣装を着せて稚児行列を行うところもあります。'
            ],
            [
                'id' => 17,
                'title' => '端午の節句',
                'start' => '05-05',
                'f_end' => '05-05',
                'color' => $color,
                'url' =>'/normalevent/show/17',
                
                 'explanation' =>
                '中国が起源で、端午とは午の月である5月の5日のこと。
                元々は青葉の茂ったこの時期に薬草を採り集める日とされ、薬草の一つである菖蒲で酒を
                造って飲み邪気払いをしたものが日本に伝わり、菖蒲が尚武に通じることから
                （上巳の節句を女児の節句にしたのに対して）端午の節句を男児の節句とした。',
                              
                'todo' => 
                '男の子の力強くたくましい成長を願って、五月人形を飾る、鯉のぼりを揚げます。
                3月20日の春分の日ごろから4月中旬に飾り始めるのが良いとされています。
                端午の節句が過ぎたら、5月中旬までに片付けるのが良いとされています。
                菖蒲湯（しょうぶゆ）に入ります。（沸かしたお風呂に菖蒲を浮かべるだけ）'
            ],
            [
                'id' => 18,
                'title' => '母の日',
                'start' => getDay($now_year,5,'Sun',2),
                'f_end' => getDay($now_year,5,'Sun',2),
                'color' => $color,
                'url' =>'/normalevent/show/18',
                
                 'explanation' =>
                '5月の第2日曜日が母の日です。日頃の感謝の気持ちを込めてカーネーションを贈るのが定番ですが、最近では品物を贈ることが
                増えてきているようです。感謝の金品に、賞状用紙を使った感謝状を付けて贈るのもよいでしょう。
                お返しは不要ですが、遠方であれば電話か手紙でお礼の心を伝えると喜ばれます。
                ちなみに白いカーネーションは亡き母を偲ぶという意味があるので避けたほうが無難です。',
                              
                'todo' => 
                '日頃の感謝の気持ちを込めてカーネーションを贈ります。品物を贈ることもあります。'
            ],
            [
                'id' => 19,
                'title' => '父の日',
                'start' => getDay($now_year,6,'Sun',3),
                'f_end' => getDay($now_year,6,'Sun',3),
                'color' => $color,
                'url' =>'/normalevent/show/19',
                
                 'explanation' =>
                '6月の第3日曜日が父の日です。日本では父の日に黄色の花を贈るといわれています。
                感謝の金品には、賞状用紙を使った感謝状を付けて贈るのもよいでしょう。
                特にお返しは不要ですが、遠方であれば電話か手紙でお礼の心を伝えると喜ばれます。',
                              
                'todo' => 
                '父の日に黄色の花を贈ります。'
            ],
            [
                'id' => 20,
                'title' => 'お中元を贈る時期',
                'start' => '07-01',
                'f_end' => '07-01',
                'color' => $color,
                'url' =>'/normalevent/show/20',
                
                 'explanation' =>
                'そもそも「中元」とは旧暦の7月15日のことで、中国では中元を司る神がいると考えられ、
                人々はこの日にお供え物をしてきました。日本では室町時代に、
                すでにあったお盆の「盆礼」という風習と結びつき、おおよそ7月15日頃までに贈る慣習になりました。',
                              
                'todo' => 
                '東日本なら7月初旬〜7月15日、西日本なら7月下旬〜8月15日に贈るのが一般的です。'
            ],
            [
                'id' => 21,
                'title' => '七夕祭',
                'start' => '07-07',
                'f_end' => '07-07',
                'color' => $color,
                'url' =>'/normalevent/show/21',
                
                 'explanation' =>
                '七夕と言えば、天の川を隔てて会うことができなくなった織姫と彦星が、
                1年に1度だけ会うことができるというロマンチックな星物語が有名な日です。
                毎年7月7日の夜に、願い事を書いた色とりどりの短冊や七夕飾りを笹の葉につるし、
                星に祈る習慣が各地で広く親しまれています。
                お祭りをしている場所も多く、特に仙台市の七夕祭りはとても有名です。',
                              
                'todo' => 
                '短冊に自分の願い事を書いて笹にかけて、願いが叶うよう祈ります。
                七夕を飾り付ける時期も元々旧暦の７月７日に行われていたことから、
                現在の新暦である７月７日に行う地域と、１ヶ月遅れの８月７日に行う地域に分かれている。'
            ],
            [
                'id' => 22,
                'title' => 'お盆',
                'start' => '08-13',
                'f_end' => '08-13',
                'color' => $color,
                'url' =>'/normalevent/show/22',
                
                 'explanation' =>
                '故人が逝去後初めて迎えるお盆を初盆(新盆)と言いますが、忌明け法要前や忌明け後幾日も
                経っていない時は、翌年のお盆を初盆(新盆)とします。特に新盆には身内や親しい方を招いて、
                僧侶にお経(棚経)をあげて貰うなど盛大に行われます。
                尚、浄土真宗では宗旨(教義)の違いにより、送り火や迎え火をしたり、精霊棚を設けるなどの習慣は
                ありません。',
                              
                'todo' => 
                'お盆の初日である13日には「迎え火」を焚いて出迎え、14・15両日には佛壇の前にお供え物で
                飾った精霊棚を設けて供養をし、16日には浄土への道しるべとなる「送り火」を焚いて送り出す
                という習わしになっています。
                関西を初め西日本の地方では月遅れの8月13日から16日の間に行われます。'
            ],
            [
                'id' => 23,
                'title' => 'お月見（中秋の名月）',
                'start' => '08-15',
                'f_end' => '08-15',
                'color' => $color,
                'url' =>'/normalevent/show/23',
                
                 'explanation' =>
                '太陰暦（旧暦）では7月を初秋・8月を仲秋・9月を晩秋といい、8月15日の満月を十五夜といって、
                1年中で一番美しく見える月であることから「中秋の名月」と呼んで、お供え物をして月を鑑賞
                （お月見）する習しがあります。
                お供え物には月見団子や秋の果物・野菜とともに秋の七草をお供えするそうです。
                月見団子は里芋の形にしますが、その理由は8月は芋名月といわれることから元々は団子ではなく
                里芋を供えていたことの名残であるそうです。',
                              
                'todo' => 
                '月見団子や秋の果物・野菜とともに秋の七草をお供えします。
                秋の七草：萩（はぎ）、尾花（すすき）、葛（くず）、撫子（なでしこ）、女郎花（おみなえし）、
                藤袴（ふじばかま）、朝貌（ききょう）'
            ],
            [
                'id' => 24,
                'title' => '菊の節句（重陽の節句）',
                'start' => '09-09',
                'f_end' => '09-09',
                'color' => $color,
                'url' =>'/normalevent/show/24',
                
                 'explanation' =>
                '陰陽説（おんみょうせつ）では9は目出度い数字の陽の中ででも最も良い数字といわれ、
                その数字が重なることから重陽といって大変目出度い日とされたそうです。
                古い日本では五節句の一番最後の節句であることから、菊の節句としても親しまれ菊を
                めでて盛大に酒宴を開き長寿を祈願したが現在では行われていません。',
                              
                'todo' => 
                '重陽の節句では、菊を鑑賞しながら「菊酒」を飲むと長寿になると言われています。
                菊酒は、蒸した菊の花びらを器に入れ、冷酒を注ぎ一晩置くことで香りを移して作ります。
                菊料理にも、蒸した後に乾燥させた菊の花びらを使用していました。
                現代では、菊の花びらを散らした盃に冷酒を注いで飲むことが主流です。
                また、重陽の節句は作物の収穫時期と重なるため、庶民の間では「栗の節句」として「栗ごはん」を食べて祝っていました。'
            ],
            [
                'id' => 25,
                'title' => '敬老の日',
                'start' => getDay($now_year,9,'Mon',3),
                'f_end' => getDay($now_year,9,'Mon',3),
                'color' => $color,
                'url' =>'/normalevent/show/25',
                
                 'explanation' =>
                '敬老の日の起源は、兵庫県の一村長が「お年寄りを敬い、お年寄りの経験と知恵を生かした農村作り」を
                目的に９月１ ５日を「としよりの日」と定めたのがキッカケとなり、小さな村から徐々に全国的に広がりを
                見せて昭和２９年(１９ ５４年)には全国的に「としよりの日」として制定されたそうです。
                しかし、その呼称が適切でないとの理由から昭和３９年(１９ ６４年)に「敬老の日」と改められ、
                後に国民の祝日としても定められましたが、平成１５年(２００３年)の国民の祝 日の改訂により
                再び９月の第３月曜日とするように変更され、同時にそれまでの９月１５日は「老人の日」とし、
                ９月 １５～２１日を「老人週間」とするように定められました。',
                              
                'todo' => 
                '家族が集まって祖父母や親を訪問することが一般的で、一緒に食事をしたり、
                プレゼントを渡したりすることが多いようです。'
            ],
            [
                'id' => 26,
                'title' => 'ハロウィン',
                'start' => '10-31',
                'f_end' => '10-31',
                'color' => $color,
                'url' =>'/normalevent/show/26',
                
                 'explanation' =>
                '本来は収穫を祝い、悪霊を追い払う行事ですが、日本では近年仮装をすることがメインになりつつ
                あり大盛り上がりしています。
                仮装の内容も、悪霊をテーマにしたものだけでなく、バリエーションが豊かです。
                関東などでは誰でも参加できる仮装パレードが開催されており、渋谷では毎年DJポリスも出動するほど
                人で賑わいます。',
                              
                'todo' => 
                '日本では近年仮装をすることがメインになりつつあります。'
            ],
            [
                'id' => 27,
                'title' => '七五三',
                'start' => '11-15',
                'f_end' => '11-15',
                'color' => $color,
                'url' =>'/normalevent/show/27',
                
                 'explanation' =>
                '中国の古い学説である陰陽説（おんみょうせつ）の「三・五・七などの奇数は目出度い数字」とされる
                ということからきており、11月15日に神社に詣でてお祓いを受けるが、15日は三と五と七の合計が
                15であることから、また11月に行なうのは定めた時が旧暦の15日の内で一番良い月だったことに
                由来するそうです。7歳・5歳・3歳になった子供の成長を祝う行事です。',
                              
                'todo' => 
                'この年の子供は、晴れ着に身を包んで、神社に参拝し、祈祷を受けます。
                参拝後に千歳飴と呼ばれる、細長い飴を受け取ります。'
            ],
            [
                'id' => 28,
                'title' => '七五三',
                'start' => '12-24',
                'f_end' => '12-24',
                'color' => $color,
                'url' =>'/normalevent/show/28',
                
                 'explanation' =>
                '日本では24日の夜にサンタさんが子供にプレゼントを持ってきてくれ、
                25日にケーキやチキンを食べることが一般的となっています。',
                              
                'todo' => 
                '日本では24日の夜にサンタさんが子供にプレゼントを持ってきてくれ、
                25日にケーキやチキンを食べることが一般的となっています。'
            ],
            [
                'id' => 29,
                'title' => '大晦日',
                'start' => '12-31',
                'f_end' => '12-31',
                'color' => $color,
                'url' =>'/normalevent/show/29',
                
                 'explanation' =>
                '月の終わりを晦日（30日＝みそか）といい、1年の終わりの日を大晦日（おおみそか）といいます。
                除夜の鐘を鳴らして1年のけがれを清め、延命と幸せが長く続くことを祈って年越しそばを食べ、
                新しい年神様を迎える準備をする日とされているそうです。
                大晦日のことを別名で除日【その年を除く(終える)日の意】といい、その夜に鳴らす鐘という意味から除夜の鐘といいます。
                人は１０８つの煩悩を持つといわれ、その煩悩を百八尊(１０８の仏や菩 薩)の功徳によって、
                一年間の苦悩や迷いを洗い流して貰い、新しい気持ちで新年が迎えられるこ とを願って、百八つの鐘を
                撞き鳴らす習わしが定着しているそうです。',
                              
                'todo' => 
                '延命と幸せが長く続くことを祈って年越しそばを食べ、新しい年神様を迎える準備をします。'
            ]
        ];
        foreach ($params as $param) {
        DB::table('normal_events')->insert($param);
        }
    }
    
}
